<template>
    <div class="detailexplain">
      <Headd></Headd>
        <ul>
            <li v-for="(item, index,) in datas" :key="index">
                <p class="expq">{{item.q}}</p>
                <p class="expa" v-for="(answer, indexa) in item.a" :key="indexa">{{answer}}</p>
            </li>
        </ul>
    </div>
</template>
<script>
import { Loading } from "element-ui";
import Headd from "../components/element/head";
export default {
  name: "explaindetail",
  data() {
    return {
      datas: [],
      loading: true
    };
  },
  components: {
    Headd
  },
  created() {
    let loadingInstance1 = Loading.service({ fullscreen: true });
    if (this.$store.state.detailexplain == 1) {
      this.$store.commit("changetn", "余额问题");
      this.datas = [
        {
          q: "Q1: 使用余额的条件",
          a: ["为了保护账户安全，使用余额前必须先绑定手机号。"]
        },
        {
          q: "Q2: 余额可以怎么用？",
          a: [
            "余额可以在饿了么平台上提现，当余额大于等于待支付金额时可以在支持在线支付的商家中进行消费。提现功能将于2016年12月25日00:00全面开放。"
          ]
        },
        {
          q: "Q3:我要如何提现？",
          a: [
            "为了保护账户和资金安全，您在提现前需要输入真实姓名和用该姓名开通的银行卡号、选择开户行，并验证已绑定饿了么账号的手机号。每日只能提现1次，每次限额50元。若提现金额超过50元，点击【提现】时系统会提示您已超额，请您修改提现金额。"
          ]
        },
        {
          q: "Q4:为什么会提现失败？",
          a: [
            "可能原因有：您的姓名、开户行、银行卡号等信息不匹配；您当日的提现次数和金额超过限制；您的账户存在异常，被风控拦截。"
          ]
        }
      ];
    } else if (this.$store.state.detailexplain == 2) {
      this.$store.commit("changetn", "红包说明");
      this.datas = [
        {
          q: "Q1: 怎么获得红包？",
          a: [
            "通过邀请好友获得",
            "在下单返红包的商家下单获得",
            "抢微信朋友分享的红包获得"
          ]
        },
        {
          q: "Q2: 红包可以做什么？",
          a: ["可以抵扣在线支付时的实际支付金额。"]
        },
        {
          q: "Q3: 红包的门槛金额按照什么金额计算？",
          a: [
            "红包的的门槛金额按照（选购菜品折后价＋餐盒费）的金额作为计算门槛，即购物车显示的金额（7.3以上版本）。假设红包满30可用，只要选购的菜品现价（折后价）＋餐盒费超过30，就可以使用红包。"
          ]
        },
        {
          q: "Q4: 一个红包能拆开多次使用吗？",
          a: ["不能，一个红包只能一次性使用，不能分开使用。"]
        },
        {
          q: "Q5: 下单的时候使用了红包，但是后来订单取消了，红包还会返还吗？",
          a: ["会的，订单无效后红包会自动返还到您的账户里。"]
        },
        {
          q: "Q6: 红包兑换码怎样兑换成红包，怎样查看红包？",
          a: ["在个人中心 > 我的红包 > 兑换红包，输入兑换码进行兑换。"]
        },
        {
          q: "Q7: 邀请好友了，为什么没获得红包？",
          a: [
            "先检查下您是否在同一设备上进行的邀请？或者被邀请人是否通过您发给对方的链接进行注册？而非自己复制链接注册的。同一设备上邀请或没有按照点击发送的链接邀请都是无效邀请。如果您是正常邀请没获得红包，可以致电客服进行查实。"
          ]
        },
        {
          q: "Q8: 预订早餐、预订午餐的红包怎么使用？在哪里查询？",
          a: [
            "预订早餐、预订午餐的红包暂时不支持直接点外卖使用，并且当前点外卖的红包也暂时不支持在预订早餐、预订午餐时使用。",
            "预订早餐、预订午餐的红包从APP首页点击“预订早餐”按钮进入后在右上角的个人中心中查找预订早餐、预订午餐的红包。"
          ]
        },
        {
          q: "Q9: 互斥红包怎么使用？",
          a: [
            "互斥红包不与其他优惠活动（包含但不限于：新用户专享、满X元减X元、满X元赠XX）同时使用。"
          ]
        },
        {
          q: "Q10: 返红包活动， 红包领取规则是什么?",
          a: [
            "同一个手机号一天限领取三个。",
            "同一注册用户一天限领取三个。",
            "注册用户红包直接发送至用户账户里。",
            "非注册用户红包以兑换码短信的形式发送至用户手机，注册后凭兑换码兑换即可。",
            "非注册用户红包以兑换码短信的形式发送至用户手机，注册后凭兑换码兑换即可。",
            "同一个手机号一天最多使用两个红包。",
            "未收到红包短信的用户注意查看手机里的拦截短信。",
            "有任何问题请拨打客服电话：10105757。"
          ]
        }
      ];
    } else if (this.$store.state.detailexplain == 3) {
      this.$store.commit("changetn", "代金券说明");
      this.datas = [
        {
          q: "Q1: 什么是商家代金券？",
          a: [
            "商家代金券是指由商家自己发放代金券，只限在指定的商家使用，可根据条件抵扣相应金额。"
          ]
        },
        {
          q: "Q2: 怎么获得商家代金券？",
          a: [
            "进入有「进店领券」或「下单返券」标示的商家即有机会获得代金券。",
            "「下单返券」需要在指定商家完成满足返券金额要求的订单后才会返还，代金券可在下次下单时使用。"
          ]
        },
        {
          q: "Q3: 商家代金券使用条件",
          a: [
            "商家代金券仅限在指定商家使用",
            "商家代金券仅限在线支付使用",
            "每个订单只能使用一张商家代金券，不可与其他代金券叠加使用"
          ]
        }
      ];
    } else if (this.$store.state.detailexplain == 4) {
      this.$store.commit("changetn", "积分问题");
      this.datas = [
        { q: "Q1: 怎么获得积分？", a: ["在线支付的订单将获得订单积分奖励"] },
        { q: "Q2: 积分用来做什么？", a: ["可以在积分商城兑换各种礼品。"] },
        {
          q: "Q3: 礼品兑换很多天了还没有收到，该怎么办？",
          a: [
            "礼品从兑换日起，3个工作日（周末不算）内处理发货，发货后，通常会在3个工作日左右送达。"
          ]
        },
        {
          q:
            "Q4: 礼品兑换中的手机充值卡兑换，怎么样进行充值，充值之前会和我电话确认嘛？",
          a: [
            "不会，手机充值卡兑换，是直接充值到您填写的手机号上，充值之前不会和您电话确认，所以您在填写电话的时候，请确认电话是否正确。"
          ]
        }
      ];
    }
    loadingInstance1.close();
    this.loading = false;
  }
};
</script>
<style>
.detailexplain {
  width: 100%;
}
.detailexplain > ul {
  width: 94%;
  padding: 3%;
}
.detailexplain > li {
  width: 100%;
  padding-top: 2%;
  padding-bottom: 2%;
  border: 1px solid red;
}
.expq {
  font-size: 0.16rem;
  line-height: 30px;
  padding: 2%;
}
.expa {
  font-size: 0.12rem;
  padding: 2%;
  line-height: 25px;
}
</style>

